app/Models/TableModel.php

    public function postSpalten_edit()
    {
        $builder=$this->db->table('spalten');
        $builder->set('SortId',$_POST['sortId']);
        $builder->set('Spalte',$_POST['spalte']);
        $builder->set('Spaltenbeschreibung',$_POST['spaltenbeschreibung']);
        $builder->where('Id',$_POST['Id']);
        $builder->where('BoardsId', $_POST['boardsId']);
        $builder->update();
---
UPDATE `spalten` SET `SortId` = '3', `Spalte` = 'Ist Erledigt3', `Spaltenbeschreibung` = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec placerat accumsan erat, non auctor ipsum sollicitudin id. Duis accumsan purus nec justo dictum eleifend.                        '
WHERE `Id` = '3'
AND `BoardsId` = '1'